In [1]:
from numpy import nan as NA

In [3]:
import pandas as pd
data = pd.Series([1, NA, 3.5, NA, 7])

In [4]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
import numpy as np
df = pd.DataFrame(np.random.randn(7, 3))

In [13]:
df

          0         1         2
0 -0.539572  0.522017 -0.422008
1 -0.429948 -0.788435  1.860239
2 -2.894004  0.169255  0.236185
3  0.982720 -0.017426 -0.403273
4 -0.884743  0.883337 -0.100408
5  2.203800 -0.169003 -1.246654
6 -0.829049  1.537587  0.878546

In [14]:
df.iloc[:4, 1] = NA
df

          0         1         2
0 -0.539572       NaN -0.422008
1 -0.429948       NaN  1.860239
2 -2.894004       NaN  0.236185
3  0.982720       NaN -0.403273
4 -0.884743  0.883337 -0.100408
5  2.203800 -0.169003 -1.246654
6 -0.829049  1.537587  0.878546

In [15]:
df.iloc[:2,2]=NA
df

          0         1         2
0 -0.539572       NaN       NaN
1 -0.429948       NaN       NaN
2 -2.894004       NaN  0.236185
3  0.982720       NaN -0.403273
4 -0.884743  0.883337 -0.100408
5  2.203800 -0.169003 -1.246654
6 -0.829049  1.537587  0.878546